# SQL Magic + SQLite from Scratch in Jupyter

## Enable SQL Magic in Jupyter

In [3]:
%load_ext sql

## Connect to (and create if it does not exist) a SQLite database

In [4]:
%sql sqlite:///archivo.db

## Create a table

In [5]:
%%sql
CREATE TABLE IF NOT EXISTS instructors (
    id INTEGER PRIMARY KEY,
    firstname TEXT,
    lastname TEXT,
    city TEXT,
    country TEXT
);

 * sqlite:///archivo.db
Done.

[]

## Insert data

In [6]:
%%sql
INSERT INTO instructors (id, firstname, lastname, city, country)
VALUES
(1, 'John', 'Doe', 'New York', 'USA'),
(2, 'Jane', 'Smith', 'London', 'UK'),
(3, 'Carlos', 'Gomez', 'Madrid', 'Spain');

 * sqlite:///archivo.db
(sqlite3.IntegrityError) UNIQUE constraint failed: instructors.id
[SQL: INSERT INTO instructors (id, firstname, lastname, city, country)
VALUES
(1, 'John', 'Doe', 'New York', 'USA'),
(2, 'Jane', 'Smith', 'London', 'UK'),
(3, 'Carlos', 'Gomez', 'Madrid', 'Spain');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

## Query data

In [7]:
%%sql
SELECT * FROM instructors;

 * sqlite:///archivo.db
Done.

[(1, 'John', 'Doe', 'New York', 'USA'),
 (2, 'Jane', 'Smith', 'London', 'UK'),
 (3, 'Carlos', 'Gomez', 'Madrid', 'Spain')]

In [8]:
%%sql
SELECT firstname, lastname
FROM instructors
WHERE country = 'Spain';

 * sqlite:///archivo.db
Done.

[('Carlos', 'Gomez')]

## Store results in a Python variable

In [9]:
%%sql result <<
SELECT * FROM instructors;

 * sqlite:///archivo.db
Done.
Returning data to local variable result

In [10]:
result

[(1, 'John', 'Doe', 'New York', 'USA'),
 (2, 'Jane', 'Smith', 'London', 'UK'),
 (3, 'Carlos', 'Gomez', 'Madrid', 'Spain')]

In [ ]:
%%sql 
DROP TABLE instructors